Repository: angrysiberianracoon/ikev2vpn
Catalog: scripts/lang/*/LC_MESSAGES/ikev2vpn.po
Languages: ru

source: the name must contain only letters, numbers and symbols [_ - . @]
ru: имя должно содержать только буквы, цифры и символы [_ - . @]

source: incorrect IP address format
ru: некорректный формат IP адреса

source: Enter the password for the client certificate (it will be displayed on the screen in clear view!) you can leave the field blank:
ru: Введите пароль для клиентского сертификата (он будет выведен на экран в открытом виде!) можно оставить это поле пустым:

source: your input: [{value}]
ru: вы ввели: [{value}]

source: continue [y] / input again [n] ?
ru: продолжить [y] / повторить ввод [n] ?

source: , try again:
ru: , попробуйте ещё раз:

source: download from web (not safe)
ru: скачать через WEB (не безопасно)

source: copy / paste over screen
ru: копировать через консоль

source: Select the method of obtaining the certificates:
ru: Выберите метод получения сертификата:

source: Download the certificate archive at:
ru: Скачайте архив сертификатов по ссылке:

source: If you successfully downloaded the certificates, type [y]
ru: Если вы полностью скачали сертификаты введите [y]

source: Copy the text between "---" characters and save it as a text file named "{file_name}"
ru: Скопируйте текст между символами "---" и сохраните его с именем "{file_name}"

source: After creating 3 files, you need to generate a certificate PKCS#12 format
ru: После создания 3-х файлов необходимо сгенерировать сертификат формата PKCS#12

source: If you are using Windows, install OpenSSL {url}
ru: Если вы используете Windows, установите OpenSSL {url}

source: Open the console in the directory with the created files and run the command:
ru: Откройте консоль в каталоге с созданными файлами и выполните команду:

source: Re-initialization will invalidate all previously issued certificates. Continue? [y / n]
ru: Реинициализация деактивирует все ранее выданные сертификаты. Продолжить? [y / n]

source: Enter the public IP address of the server:
ru: Введите публичный IP адрес сервера:

source: First run the initial setup
ru: Сначала выполните первоначальную настройку

source: Enter the client name:
ru: Введите имя клиента:

source: Client [{user}] already exist. Re-create the certificate? [y / n]
ru: Клиент [{user}] уже существует. Сгенерировать сертификат заново? [y / n]

source: No active users
ru: Активные клиенты отсутствуют

source: [ back ]
ru: [ назад ]

source: Select user for ban:
ru: Выберите клиента для бана:

source: Client [{user}] was banned
ru: Клиент [{user}] забанен

source: initial setup
ru: первоначальная настройка

source: add client
ru: добавить клиента

source: ban client
ru: забанить клиента

source: exit
ru: выход
